Core/src/src/DataProcessors/AzRy1C_JiraSyncConsole/AzRy1C_JiraSyncConsole.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRy1C_JiraSyncConsole</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверWorklogs</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Resource</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HttpPath</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Authorization</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowLogs</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountsWithNoProjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WorklogResource</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыхAccounts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоИзмененыхAccounts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыеСотрудники</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыеЗаданиеНаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоWorklogsКолИзмененыеДлительностьВЧасах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадНаРаботуМесацЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыхJiraProjects</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AccountCategoriesAndAccounts</name>
    <attributes>
      <name>Вибор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Self</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.AzRyTempoObjects</types>
      </type>
    </attributes>
    <attributes>
      <name>CategoryID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проекты</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>LinksToProjects</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененName</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененCategoryID</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>JiraUsers</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Worklogs</name>
    <attributes>
      <name>wr_user_account_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_user_name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_account</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_date</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_hours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_last_update_time</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_count</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_issue_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_jiraproject_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСотрудник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПроект</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеНаРаботу</name>
      <type>
        <types>DocumentRef.ЗаданиеНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьВЧасах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>tempoWorklogId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>JiraProject</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
      </type>
    </attributes>
    <attributes>
      <name>JiraProjectСоот</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыСПустымиЗаказ</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>JiraProjects</name>
    <attributes>
      <name>Новый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Измененный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>lead</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>leadId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>active</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>projectTypeKey</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyJiraProject</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/DataProcessors/AzRy1C_JiraSyncConsole/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

#Область Accounts_and_AccountCategories_ПЕРЕМЕННЫЕ_МОДУЛЯ
Перем ТЗПроектов;
Перем СписокИсключений;
#КонецОбласти

Перем RESTServices;
//Перем Сервер Экспорт;
//Перем Resource Экспорт;
//Перем authorization Экспорт;
Перем ИмяФайлаЗапроса Экспорт;
Перем Парам Экспорт;
Перем ЗащищенноеСоединение;
Перем JsonData;

#Область Accounts_and_AccountCategories_ПЕРЕМЕННЫЕ_МОДУЛЯ
Перем мТЗСотрудники;
Перем мТЗПроекты;
Перем мТЗПроектыПустые;
#КонецОбласти

#Область Worklogs_ПЕРЕМЕННЫЕ_МОДУЛЯ
Перем мЗаданияНаРаботу;
Перем НоменклатураIssue;
Перем мJiraProjects;
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

#Область Accounts_and_AccountCategories_ПРОЦЕДУРЫ_И_ФУНКЦИИ


// HTTP Requests

Функция GetAccountCategories() Экспорт
	
	// Возврат ВыполнитьHTTPЗапрос(Перечисления.AzRyTempoObjects.Account_categories);
	Возврат ВыполнитьHTTPЗапрос5(Перечисления.AzRyTempoObjects.Account_categories);
	
КонецФункции

Функция GetAccounts() Экспорт

	//Возврат ВыполнитьHTTPЗапрос(Перечисления.AzRyTempoObjects.Accounts);
	Возврат ВыполнитьHTTPЗапрос5(Перечисления.AzRyTempoObjects.Accounts);
	
КонецФункции

Функция GetAccountLinks(JsonDataAccounts) Экспорт
	
	Для каждого ТекАкаунт Из JsonDataAccounts.results Цикл
		Ответ = ВыполнитьHTTPЗапрос("accounts/" + ТекАкаунт.key + "/" + "links");
		AccountLinks = JSON2Текст(Ответ.Текст);
		Если AccountLinks.metadata.count > 0 Тогда
			ТекАкаунт.links.Вставить("data", AccountLinks);
		КонецЕсли; 
	КонецЦикла;
	
КонецФункции

// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция GetAccountsAndAccountCategories() Экспорт
	
	ТЗПроектов = ЗапросТЗПроектов();
	
	Ответ = GetAccountCategories();
	Если Ответ.ОщибкаСоединения Или Ответ.ОщибкаКодСостояния Тогда
		Возврат Ответ;
	КонецЕсли; 		
	JsonDataAccountCategories = JSON2Текст(Ответ.Текст);
	
	Ответ = GetAccounts();
	Если Ответ.ОщибкаСоединения Или Ответ.ОщибкаКодСостояния Тогда
		Возврат Ответ;
	КонецЕсли;
	JsonDataAccounts = JSON2Текст(Ответ.Текст);

	СоотвКонтрагенты = СоответствиеКонтрагентыCustomers(JsonDataAccounts);
	Если AccountsWithNoProjects Тогда
		GetAccountLinks(JsonDataAccounts); 		
	КонецЕсли;
	
	ЗаполнитьТаблицуAccountCategories(JsonDataAccountCategories, JsonDataAccounts, СоотвКонтрагенты);
	
	Worklogs.Очистить();
	
	Ответ.Вставить("ДопИнфо", ДопИнфо(AccountCategoriesAndAccounts));
	Возврат Ответ;
	
КонецФункции

Функция СозданиеНовыхПроектов() Экспорт
	
	ТЗПроектов = ЗапросТЗПроектов();	
	
	Для каждого ТекСтрока Из AccountCategoriesAndAccounts Цикл	
		Если Не ТекСтрока.Вибор Тогда Продолжить; КонецЕсли; 
		СоздатьНовыйПроект(ТекСтрока, "");
	КонецЦикла;	

	GetAccountsAndAccountCategories();
	
КонецФункции

Процедура ЗаполнитьТаблицуAccountCategories(JsonDataAccountCategories, JsonDataAccounts, СП) Экспорт
	
	СписокAccounts = ОбновитьТаблицуWorklogs().ДопИнфо.UniqueAccountsList;
	
	AccountCategoriesAndAccounts.Очистить();		
	Для каждого ТекСтрока Из JsonDataAccountCategories.results Цикл
		
		////Debug
		//Если НЕ ТекСтрока.key = "CDSPSL" Тогда
		//	Продолжить;	
		//КонецЕсли; 
		////Debug
		
		НоваяСтрока = AccountCategoriesAndAccounts.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Type    = Перечисления.AzRyTempoObjects.Account_categories;
		НоваяСтрока.Проекты = ОтборТЗПроекты(ТЗПроектов, ТекСтрока.id, НоваяСтрока.Type);
		Если ЗначениеЗаполнено(НоваяСтрока.Проекты) Тогда
			НоваяСтрока.ИзмененName = НоваяСтрока.Проекты.Наименование <> НаименованиеПроекта(НоваяСтрока.Key, НоваяСтрока.Name);
		Иначе
			Если НЕ НоваяСтрока.Status = "CLOSED" Тогда
				НоваяСтрока.Вибор = Истина;			
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого ТекСтрока Из JsonDataAccounts.results Цикл
		
		////Debug
		//Если НЕ ТекСтрока.key = "CDSPSL" Тогда
		//	Продолжить;	
		//КонецЕсли; 
		////Debug
		
		Если AccountsWithNoProjects И СписокИсключений.НайтиПоЗначению(СокрЛП(ТекСтрока.name)) = Неопределено Тогда
			Если ТекСтрока.links.Свойство("data") И ТекСтрока.links.data.metadata.count > 0 Тогда
				Продолжить;			
			КонецЕсли; 		
		КонецЕсли; 
		
		НоваяСтрока = AccountCategoriesAndAccounts.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Type    = Перечисления.AzRyTempoObjects.Accounts;
		НоваяСтрока.Проекты = ОтборТЗПроекты(ТЗПроектов, ТекСтрока.id, НоваяСтрока.Type);
		НоваяСтрока.CategoryID = ТекСтрока.category.id;
		Если ТекСтрока.Свойство("customer") Тогда		
			НоваяСтрока.Контрагент = СП[ТекСтрока.customer.key];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Проекты) Тогда
			НоваяСтрока.ИзмененName = НоваяСтрока.Проекты.Наименование <> НаименованиеПроекта(НоваяСтрока.Key, НоваяСтрока.Name);
		Иначе
			Если Не СписокAccounts.НайтиПоЗначению(НоваяСтрока.Key) = Неопределено Или НЕ НоваяСтрока.Status = "CLOSED" Тогда 
				НоваяСтрока.Вибор = Истина;			
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Проекты.Родитель) 
			И НоваяСтрока.Проекты.Родитель.AzRyTempoObjectType = Перечисления.AzRyTempoObjects.Account_categories
			И НоваяСтрока.Проекты.Родитель.AzRyTempoObjectID <> ТекСтрока.category.id Тогда
			НоваяСтрока.ИзмененCategoryID = Истина;		
		КонецЕсли; 
		
	КонецЦикла;		
	AccountCategoriesAndAccounts.Сортировать("Type, ID Возр");
	
КонецПроцедуры

Функция СоздатьНовыйПроект(ТекСтрока, Комментарий) Экспорт
	
	TempoObjectType = ТекСтрока.Type;
	TempoObjectID   = ТекСтрока.ID;
	TempoObjectKey  = ТекСтрока.Key;
	TempoObjectName = ТекСтрока.Name;
	CategoryID      = ТекСтрока.CategoryID;
	Контрагент      = ТекСтрока.Контрагент;
	
	Парам = Новый Структура("Ошибка, Текст", Ложь, "");
		
	НачатьТранзакцию();
	Попытка
		Если TempoObjectType = Перечисления.AzRyTempoObjects.Account_categories Тогда
			Ответ = СозданиеСправочникаПроекты(TempoObjectType, TempoObjectID, TempoObjectKey, TempoObjectName, Контрагент);
		ИначеЕсли TempoObjectType = Перечисления.AzRyTempoObjects.Accounts Тогда	
			ТЗПроектов = ЗапросТЗПроектов();
			Проект = ОтборТЗПроекты(ТЗПроектов, CategoryID, Перечисления.AzRyTempoObjects.Account_categories);
			Если Не Проект = Справочники.Проекты.ПустаяСсылка() Тогда
				Ответ = СозданиеСправочникаПроекты(TempoObjectType, TempoObjectID, TempoObjectKey, TempoObjectName, Контрагент, Проект);
			КонецЕсли; 
		КонецЕсли; 
	Исключение		
		Парам.Вставить("Ошибка", Истина);
		Парам.Вставить("Текст", "შეცდომა ახალი პროექტის შექმნისას, შეცდომის ტექსტი:" + ОписаниеОшибки());
		ОтменитьТранзакцию();
		
		Возврат Парам;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
	Возврат Парам;
	
КонецФункции

Функция ОбновлениеПроектов() Экспорт 

	ТЗПроектов = ЗапросТЗПроектов();
	
	Парам = Новый Структура("Ошибка, Текст", Ложь, "");
	
	Попытка
		НачатьТранзакцию();
		Для каждого ТекСтрока Из AccountCategoriesAndAccounts Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Проекты) И ТекСтрока.ИзмененName Тогда
				Объ = ТекСтрока.Проекты.ПолучитьОбъект();
				Объ.Наименование = НаименованиеПроекта(ТекСтрока.Key, ТекСтрока.Name);
				Объ.Записать();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекСтрока.Проекты.Родитель) И ТекСтрока.ИзмененCategoryID Тогда
				НовыйПроект = ОтборТЗПроекты(ТЗПроектов, ТекСтрока.CategoryID, Перечисления.AzRyTempoObjects.Account_categories);
				Если ЗначениеЗаполнено(НовыйПроект) Тогда
					Объ = ТекСтрока.Проекты.ПолучитьОбъект();
					Объ.Родитель = НовыйПроект;
					Объ.Записать();
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;				
	Исключение
		Парам.Вставить("Ошибка", Истина);
		Парам.Вставить("Текст", "შეცდომა პროექტის დასახელების განახლებისას, შეცდომის ტექსტი:" + ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Парам;
		
КонецФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ДопИнфо(ТЗ)

	Парам = Новый Структура("КоличествоНовых, КоличествоИзмененые", 0, 0);
	
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока.Вибор Тогда
			Парам.КоличествоНовых = Парам.КоличествоНовых  + 1;
		КонецЕсли;
		
		Если ТекСтрока.ИзмененName Или ТекСтрока.ИзмененCategoryID Тогда
			Парам.КоличествоИзмененые = Парам.КоличествоИзмененые  + 1;
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Парам;

КонецФункции
 
Функция ВыполнитьHTTPЗапрос(ResourcePlus)
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("authorization", Authorization);
	
	// Соединение 
	Парам.Соединение.Сервер               = Сервер;
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Парам.Resource        = Resource + "/" + ResourcePlus;
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции

Функция ВыполнитьHTTPЗапрос5(ResourcePlus)
	
	КлассJira = Новый COMОбъект("AzRy.Atlassian.ApiTempoIO");
	
	Если ResourcePlus = Перечисления.AzRyTempoObjects.Account_categories Тогда
		json_text = КлассJira.GetAccountCategories();	
	Иначе 	
	    json_text = КлассJira.GetAccounts();
	КонецЕсли; 
	
	Ответ = Новый Структура;
	Ответ.Вставить("ОщибкаСоединения", Ложь);
	Ответ.Вставить("ОщибкаКодСостояния", Ложь);
	Ответ.Вставить("HTTPЗапрос", Неопределено);
	Ответ.Вставить("Текст", json_text);
	
	Возврат Ответ;

КонецФункции

Функция JSON2Текст(Текст)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Текст);		
	
	Возврат ПрочитатьJSON(ЧтениеJSON);	

КонецФункции

Функция JSON2Текст2(Текст)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Текст);		
	
	Возврат ПрочитатьJSON(ЧтениеJSON, Истина);	

КонецФункции

Функция JSON2ТекстВСтруктуру(Текст)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Текст);		
	
	Возврат ЗаполнитьСтруктуруИзОтветаJSON(ЧтениеJSON);	

КонецФункции

Функция ЗапросПроекты(TempoObjectTypes)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка,
		|	Проекты.AzRyTempoObjectID,
		|	Проекты.AzRyTempoObjectType
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.AzRyTempoObjectType В(&AzRyTempoObjectTypes)
		|	И Проекты.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("AzRyTempoObjectTypes", TempoObjectTypes);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОтборТЗПроекты(ТЗПроектов, TempoObjectID, TempoObjectType)

	Отбор = Новый Структура();
	Отбор.Вставить("AzRyTempoObjectID", TempoObjectID);
	Отбор.Вставить("AzRyTempoObjectType", TempoObjectType);
	
	Строки = ТЗПроектов.НайтиСтроки(Отбор);	
	Если Строки.Количество() > 0 Тогда
		Возврат Строки[0].Ссылка;
	КонецЕсли;	
	
	Возврат Справочники.Проекты.ПустаяСсылка();

КонецФункции

Функция СозданиеСправочникаПроекты(TempoObjectType, TempoObjectID, TempoObjectKey, TempoObjectName, Контрагент, Владелец = Неопределено)
	
	TypeСтрока = ?(TempoObjectType = Перечисления.AzRyTempoObjects.Account_categories, "AC", "A");
	
	Парам = Новый Структура("Ошибка, Текст", Ложь, "");
	Ответ = ПроверкаПередСозданиемСправочникаПроекты2(TempoObjectID, TempoObjectType);
	
	НачатьТранзакцию();
	Попытка
		
		Если ЗначениеЗаполнено(Ответ) Тогда	
				
		Иначе 		
			НовыйПроект = Справочники.Проекты.СоздатьЭлемент();
			НовыйПроект.УстановитьНовыйКод();
			//НовыйПроект.Наименование = TempoObjectKey + " - " + TypeСтрока + " - " + TempoObjectName;
			НовыйПроект.Наименование = НаименованиеПроекта(TempoObjectKey, TempoObjectName);
			НовыйПроект.Контрагент   = Контрагент;
			НовыйПроект.AzRyTempoObjectType = TempoObjectType;
			НовыйПроект.AzRyTempoObjectID   = TempoObjectID;
			НовыйПроект.AzRyTempoObjectKey  = TempoObjectKey;
			НовыйПроект.AzRyTempoObjectName = TempoObjectName;
			НовыйПроект.Родитель = Владелец;
			НовыйПроект.Записать();
		КонецЕсли;	
		
	Исключение
		Парам.Вставить("Ошибка", Истина);
		Парам.Вставить("Текст", "შეცდომა ახალი პროექტის შექმნისას, შეცდომის ტექსტი:" + ОписаниеОшибки());
		ОтменитьТранзакцию();
		
		Возврат Парам;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
			
	Возврат Парам;
	
КонецФункции

Функция ЗапросТЗПроектов()

	Если ЗначениеЗаполнено(ТЗПроектов) Тогда
		Возврат ТЗПроектов;
	Иначе 		
		TempoObjectTypes = Новый СписокЗначений;
		TempoObjectTypes.Добавить(Перечисления.AzRyTempoObjects.Account_categories);
		TempoObjectTypes.Добавить(Перечисления.AzRyTempoObjects.Accounts);	
		
		Возврат ЗапросПроекты(TempoObjectTypes);
	КонецЕсли; 
	
КонецФункции

Функция ПроверитьРеквизитыПроекта(Проект)

	Если ЗначениеЗаполнено(Проект.Контрагент) Тогда
		
	Иначе 
	
	КонецЕсли; 

КонецФункции

Функция СоответствиеКонтрагентыCustomers(Accounts)

	СП = Новый СписокЗначений;
	
	Для каждого ТекСтрока Из Accounts.results Цикл
		Если ТекСтрока.Свойство("customer") Тогда		
			СП.Добавить(ТекСтрока.customer.key);		
		КонецЕсли; 		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ИНН
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	И Контрагенты.ИНН В(&ИНН)";
	
	Запрос.УстановитьПараметр("ИНН", СП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Соответствие = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(ВыборкаДетальныеЗаписи.ИНН, ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПроверкаПередСозданиемСправочникаПроекты2(TempoObjectID, TempoObjectType)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.AzRyTempoObjectID = &TempoObjectID
		|	И Проекты.AzRyTempoObjectType = &TempoObjectType
		|	И Проекты.ПометкаУдаления <> ИСТИНА
		|";
	
	Запрос.УстановитьПараметр("TempoObjectID", TempoObjectID);
	Запрос.УстановитьПараметр("TempoObjectType", TempoObjectType);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса[0].Ссылка;
	Иначе 
		Возврат Справочники.Проекты.ПустаяСсылка();
	КонецЕсли; 

КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(?(ЯвляетсяЧислом(Лев(Чтение.ТекущееЗначение, 1)), "_", "") + Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = ?(ЯвляетсяЧислом(Лев(Чтение.ТекущееЗначение, 1)), "_", "") + Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

Функция ЯвляетсяЧислом(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Если Значение = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		Попытка
			Р = Число(Значение);
		Исключение
			Возврат Ложь;
		КонецПопытки;
			Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Jira_Users_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Функция ОбновитьТаблицаДжираПользователи() Экспорт 

	ВыполнитьHTTPЗапрос2();		

КонецФункции

Функция ВыполнитьHTTPЗапрос2()
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("Authorization", "Basic amlyYS5ib2FkbWluQGF6cnkuY29tOm1UekFwRTlrTkxuTnZYc2JDZjU5NjcyRA==");
		
	// Соединение 	
	Парам.Соединение.Сервер               = "azrystudio.jira.com";  
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	//Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Парам.Resource        = "/rest/api/2/group/member?groupname=users";
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции

Функция ВыполнитьHTTPЗапрос6(accountId)
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("Authorization", "Basic amlyYS5ib2FkbWluQGF6cnkuY29tOm1UekFwRTlrTkxuTnZYc2JDZjU5NjcyRA==");
		
	// Соединение 	
	Парам.Соединение.Сервер               = "azrystudio.jira.com";  
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Парам.Resource        = "/rest/api/2/user?accountId=" + accountId;
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции

Функция ВыполнитьHTTPЗапрос7(issueId)
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("Authorization", "Basic Z2VvcmdlLm1hbXVsYXNodmlsaUBhenJ5LmNvbTpBVEFUVDN4RmZHRjBGNlBfcDhpLTZpMkRWS01SNXNMdjlJeVNhNUY2MlQ5cFdXVXhYNzBKWFJYd1NiVHphejd5VFltY1lZRXNEN09KdGpCZVNvQ3Fiak9zUi1ienRzOE82N3dRclQ5V1RvYzc4cWNmV1VMWWowQTFNYWpIUnQ4NWppY0w1YmkyZ0lZempOOER6X1I0SmlxeFdSRW1Ea0RrUTcxUS14elZKLWlSOU9IZUIwQnphRWs9OEUzODRCNkE=");
		
	// Соединение 	
	Парам.Соединение.Сервер               = "azrystudio.jira.com";  
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Парам.Resource        = "/rest/api/2/issue/" + issueId + "?fields=project";
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции
 
#КонецОбласти

#Область Worklogs_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Функция ОбновитьТаблицуWorklogs() Экспорт 

	ПроектыСПустымиЗаказ.Очистить();
	Worklogs.Очистить();
	
	мЗаданияНаРаботу = Новый ТаблицаЗначений;
	
	Ответ = ВыполнитьHTTPЗапрос3();
	Если Ответ.ОщибкаСоединения Или Ответ.ОщибкаКодСостояния Тогда
		Ответ.Вставить("ДопИнфо", Неопределено);
		Возврат Ответ;
	КонецЕсли;
	 
	JsonDataWorklogs = JSON2Текст(Ответ.Текст);
	ArrayOfResults = JsonDataWorklogs.results;
	
	Пока JsonDataWorklogs.metadata.Свойство("next") Цикл
		next = JsonDataWorklogs.metadata.next;
		next = СтрЗаменить(next, "https://api.tempo.io", "");
		Ответ = ВыполнитьHTTPЗапрос3(next);
		JsonDataWorklogs = JSON2Текст(Ответ.Текст);
		ArrayOfResults = ДобавитьЭлементыМассиваВМассив(ArrayOfResults, JsonDataWorklogs.results);
	КонецЦикла;
	
	Если ArrayOfResults.Количество() > 0 Тогда
		ОбновитьТЗСотрудники(ArrayOfResults);
		ОбновитьТЗПроекты(ArrayOfResults);
		ОбновитьТЗJiraProjects();
	КонецЕсли; 
	
	// პირველი შევსება
	Н = 0;
	Для каждого ТекСтрока Из ArrayOfResults Цикл
		Н = Н + 1;	
		// Debug
		//Если Не ТекСтрока.wr_user_name = "George Mamulashvili" Тогда
		//	Продолжить;	
		//КонецЕсли; 
		
		//Если Н = 10 Тогда		
		//	Прервать;	
		//КонецЕсли; 
		
		НоваяСтрока = Worklogs.Добавить();
		НоваяСтрока.wr_account = ТекСтрока.attributes.values[0].value;
		НоваяСтрока.wr_date    = ТекСтрока.startDate;
		НоваяСтрока.wr_hours   = ТекСтрока.billableSeconds / 60 / 60;
		НоваяСтрока.wr_last_update_time = ТекСтрока.updatedAt;
		НоваяСтрока.wr_user_account_id  = ТекСтрока.author.accountId;
		НоваяСтрока.tempoWorklogId      = ТекСтрока.tempoWorklogId;
		НоваяСтрока.wr_issue_id         = СтрЗаменить(ТекСтрока.issue.id, " ", "");
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		// თანამშრომლის მოძიება
		НайдСтрока = мТЗСотрудники.Найти(СокрЛП(ТекСтрока.author.accountId), "UserAccountId");
		Если НайдСтрока = Неопределено Тогда
			НоваяСтрока.НовыйСотрудник = Истина;
			Ответ2 = ВыполнитьHTTPЗапрос6(СокрЛП(ТекСтрока.author.accountId));
			authorДанные = JSON2ТекстВСтруктуру(Ответ2.Текст);
			НоваяСтрока.wr_user_name = authorДанные.displayName;
		Иначе 
			НоваяСтрока.НовыйСотрудник = Ложь;
			НоваяСтрока.Сотрудник      = НайдСтрока.Ссылка; 
		КонецЕсли;
		
		// პროექტის მოძიება
		НайдСтрока = мТЗПроекты.Найти(СокрЛП(ТекСтрока.attributes.values[0].value), "AzRyTempoObjectKey");
		Если НайдСтрока = Неопределено Тогда
			НоваяСтрока.НовыйПроект = Истина;
		Иначе 
			НоваяСтрока.НовыйПроект = Ложь;
			НоваяСтрока.Проект      = НайдСтрока.Ссылка; 
		КонецЕсли;		
		
	КонецЦикла;
	
	Если Worklogs.Количество() > 0 Тогда
		ОбновитьЗаданияНаРаботу2(Worklogs.ВыгрузитьКолонку("tempoWorklogId"));
		//ОбновитьТЗJiraProjects(Worklogs.ВыгрузитьКолонку("wr_issue_id"));
	КонецЕсли;  
			
	// მეორე შევსება
	Если мЗаданияНаРаботу.Количество() > 0 Тогда
		Для каждого ТекСтрока Из Worklogs Цикл
			
			Отбор = Новый Структура();
			Отбор.Вставить("tempoWorklogId", ТекСтрока.tempoWorklogId);
			
			Строки = мЗаданияНаРаботу.НайтиСтроки(Отбор);
			Если Строки.Количество() > 0 Тогда
				ТекСтрока.ЗаданиеНаРаботу    = Строки[0].ЗаданиеНаРаботу;
				ТекСтрока.ДлительностьВЧасах = Строки[0].ЗаданиеНаРаботу.Работы[0].Трудоемкость;
				ТекСтрока.JiraProject        = Строки[0].JiraProject;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	//СоотJiraProjects = Новый Соответствие;
	// Temp	
	Для каждого ТекСтрока Из Worklogs Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.JiraProject) Тогда
			Продолжить;				
		КонецЕсли;
		
		Ответ3 = ВыполнитьHTTPЗапрос7(ТекСтрока.wr_issue_id);
		Если Ответ3.ОщибкаСоединения Тогда
			Ответ.Вставить("ДопИнфо", Неопределено);
			Возврат Ответ;
		КонецЕсли;
		Если Ответ3.ОщибкаКодСостояния Тогда
			Продолжить;
		КонецЕсли;		
		JsonDataWorklogs = JSON2Текст2(Ответ3.Текст);
		JiraProjectСоот   = JsonDataWorklogs.Получить("fields").Получить("project");
		ТекСтрока.wr_jiraproject_id = JiraProjectСоот.Получить("id");
		
		// ჯირა პროექტის მოძიება
		НайдСтрока = мJiraProjects.Найти(ТекСтрока.wr_jiraproject_id, "id");
		Если Не НайдСтрока = Неопределено Тогда 
			ТекСтрока.JiraProject = НайдСтрока.Ссылка;	 
		КонецЕсли;
		
		//СоотJiraProjects.Вставить(ТекСтрока.wr_jiraproject_id, JiraProjectСоот);
		
	КонецЦикла;	
	// Temp
	
	
	// ცარიელი შეკვეთების მქონე პროექტების ცხრილის შევსება
	ПроектыСПустымиЗаказ.Очистить();
	Для каждого ТекСтрока Из мТЗПроектыПустые Цикл	
		НоваяСтрока = ПроектыСПустымиЗаказ.Добавить();
		НоваяСтрока.Проект = ТекСтрока.Ссылка;	
	КонецЦикла;
	
	//Worklogs.Сортировать("Сотрудник Возр");
	Ответ.Вставить("ДопИнфо", ДопИнфоWorklogs(Worklogs));
	
	Возврат Ответ;
	
КонецФункции

Функция ВыполнитьHTTPЗапрос3(Resource = Неопределено)
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("authorization", Authorization);
		
	// Соединение 	
	Парам.Соединение.Сервер               = "api.tempo.io";
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Если Resource = Неопределено Тогда
		Парам.Resource        = "/4/worklogs?from=" + Формат(НачалоМесяца(ЗадНаРаботуМесацЗагрузки), "ДФ=yyyy-MM-dd") + "&to=" + Формат(КонецМесяца(ЗадНаРаботуМесацЗагрузки), "ДФ=yyyy-MM-dd");
	Иначе 	
		Парам.Resource        = Resource;	
	КонецЕсли; 
	
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции

Процедура ОбновитьТЗСотрудники(JsonDataWorklogs) Экспорт

	СписокUserAccountId = Новый Массив;
	Для каждого ТекСтрока Из JsonDataWorklogs Цикл
		Если СписокUserAccountId.Найти(СокрЛП(ТекСтрока.author.accountId)) = Неопределено Тогда
			СписокUserAccountId.Добавить(СокрЛП(ТекСтрока.author.accountId));		
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиAzRyJiraUserIDs.Ссылка,
		|	СотрудникиAzRyJiraUserIDs.id КАК UserAccountId
		|ИЗ
		|	Справочник.Сотрудники.AzRyJiraUserIDs КАК СотрудникиAzRyJiraUserIDs
		|ГДЕ
		|	СотрудникиAzRyJiraUserIDs.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиAzRyJiraUserIDs.id В(&UserAccountId)";
	
	Запрос.УстановитьПараметр("UserAccountId", СписокUserAccountId);
	
	мТЗСотрудники = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ОбновитьТЗПроекты(JsonDataWorklogs) Экспорт

	Список_wr_account = Новый Массив;
	Для каждого ТекСтрока Из JsonDataWorklogs Цикл
		Если Список_wr_account.Найти(СокрЛП(ТекСтрока.attributes.values[0].value)) = Неопределено Тогда
			Список_wr_account.Добавить(СокрЛП(ТекСтрока.attributes.values[0].value));
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.AzRyTempoObjectID КАК AzRyTempoObjectID,
		|	Проекты.AzRyTempoObjectType КАК AzRyTempoObjectType,
		|	Проекты.AzRyTempoObjectKey КАК AzRyTempoObjectKey,
		|	Проекты.AzRyTempoObjectName КАК AzRyTempoObjectName,
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.ПометкаУдаления = ЛОЖЬ
		|	И Проекты.AzRyTempoObjectKey В(&TempoObjectKey)
		|	И Проекты.AzRyTempoObjectType = &AzRyTempoObjectType
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И Проекты.AzRyTempoObjectKey В(&TempoObjectKey)
		|	И Проекты.AzRyTempoObjectType = &AzRyTempoObjectType
		|	И Проекты.AzRy_ЗаказПокупателя = &AzRy_ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("TempoObjectKey", Список_wr_account);
	Запрос.УстановитьПараметр("AzRyTempoObjectType", Перечисления.AzRyTempoObjects.Accounts);
	Запрос.УстановитьПараметр("AzRy_ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	мТЗПроекты       = РезультатЗапроса[0].Выгрузить();
	мТЗПроектыПустые = РезультатЗапроса[1].Выгрузить();
		
КонецПроцедуры

Процедура ОбновитьЗаданияНаРаботу(JsonDataWorklogs) Экспорт

	СписокДат         = Новый Массив;
	СписокСотрудников = Новый Массив;
	СписокПроекты     = Новый Массив;
	
	Для каждого ТекСтрока Из JsonDataWorklogs Цикл
		Дата = Дата(СтрЗаменить(ТекСтрока.wr_date, "-", ""));
		Если ЗначениеЗаполнено(Дата) И СписокДат.Найти(Дата) = Неопределено Тогда
			СписокДат.Добавить(Дата);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Сотрудник) И СписокСотрудников.Найти(ТекСтрока.Сотрудник) = Неопределено Тогда
			СписокСотрудников.Добавить(ТекСтрока.Сотрудник);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Проект) И СписокПроекты.Найти(ТекСтрока.Проект) = Неопределено Тогда
			СписокПроекты.Добавить(ТекСтрока.Проект);
		КонецЕсли;		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК ЗаданиеНаРаботу,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.AzRyПроекты,
		|	ВложенныйЗапрос.AzRyJiraSelectVersion
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаданиеНаРаботу.Ссылка КАК Ссылка,
		|		НАЧАЛОПЕРИОДА(ЗаданиеНаРаботу.Дата, ДЕНЬ) КАК Дата,
		|		ЗаданиеНаРаботу.Сотрудник КАК Сотрудник,
		|		ЗаданиеНаРаботу.AzRyПроекты КАК AzRyПроекты,
		|		ЗаданиеНаРаботу.AzRyJiraSelectVersion КАК AzRyJiraSelectVersion
		|	ИЗ
		|		Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|	ГДЕ
		|		ЗаданиеНаРаботу.ПометкаУдаления = ЛОЖЬ
		|		И ЗаданиеНаРаботу.Проведен = ИСТИНА) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Дата В(&Дата)
		|	И ВложенныйЗапрос.Сотрудник В(&Сотрудник)
		|	И ВложенныйЗапрос.AzRyПроекты В(&AzRyПроекты)
		|	И ВложенныйЗапрос.AzRyJiraSelectVersion >= &AzRyJiraSelectVersion";
	
	Запрос.УстановитьПараметр("Дата", СписокДат);
	Запрос.УстановитьПараметр("Сотрудник", СписокСотрудников);
	Запрос.УстановитьПараметр("AzRyПроекты", СписокПроекты);
	Запрос.УстановитьПараметр("AzRyJiraSelectVersion", Число(WorklogResource));
	
	мЗаданияНаРаботу = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ОбновитьЗаданияНаРаботу2(JsonDataWorklogIDS) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Ссылка КАК ЗаданиеНаРаботу,
		|	ЗаданиеНаРаботу.AzRytempoWorklogId КАК tempoWorklogId,
		|	ЗаданиеНаРаботу.AzRyJiraProject КАК JiraProject,
		|	ЗаданиеНаРаботу.AzRyJiraProject.id КАК JiraProjectid
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Проведен
		|	И ЗаданиеНаРаботу.AzRytempoWorklogId В(&tempoWorklogId)";
	
	Запрос.УстановитьПараметр("tempoWorklogId", JsonDataWorklogIDS);
	
	мЗаданияНаРаботу = Запрос.Выполнить().Выгрузить();
		
КонецПроцедуры

Функция ДопИнфоWorklogs(ТЗ)

	Парам = Новый Структура("КоличествоНовыеСотрудники, КоличествоНовыеЗаданиеНаРаботу, WorklogsКолИзмененыеДлительностьВЧасах, UniqueAccountsList", 0, 0, 0, Новый СписокЗначений);
	
	Список = Новый СписокЗначений;
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока.НовыйСотрудник И Список.НайтиПоЗначению(ТекСтрока.wr_user_account_id) = Неопределено Тогда
			Список.Добавить(ТекСтрока.wr_user_account_id);
			Парам.КоличествоНовыеСотрудники = Парам.КоличествоНовыеСотрудники  + 1;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ЗаданиеНаРаботу) Тогда
			Парам.КоличествоНовыеЗаданиеНаРаботу = Парам.КоличествоНовыеЗаданиеНаРаботу  + 1;
		КонецЕсли;
		
		Если ТекСтрока.wr_hours <> ТекСтрока.ДлительностьВЧасах Тогда
			Парам.WorklogsКолИзмененыеДлительностьВЧасах = Парам.WorklogsКолИзмененыеДлительностьВЧасах  + 1;	
		КонецЕсли;
		
		Если Парам.UniqueAccountsList.НайтиПоЗначению(ТекСтрока.wr_account) = Неопределено Тогда
			Парам.UniqueAccountsList.Добавить(ТекСтрока.wr_account);	
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Парам;

КонецФункции

Функция ЗаданияНаРаботу() Экспорт 

	Парам = Новый Структура("Дата, Сотрудник, Проект, AzRyJiraSelectVersion");
	Для каждого ТекСтрока Из Worklogs Цикл
		Парам.Дата = Дата(СтрЗаменить(ТекСтрока.wr_date, "-", ""));
		Если ЗначениеЗаполнено(Сотрудник) Тогда			
			Если Сотрудник = ТекСтрока.Сотрудник Тогда
				СоздатьЗаданияНаРаботу(ТекСтрока); 			
			КонецЕсли;
		Иначе 
			СоздатьЗаданияНаРаботу(ТекСтрока); 
		КонецЕсли; 		
	КонецЦикла;

КонецФункции

Процедура СоздатьЗаданияНаРаботу(ТекСтрока)
	
	Парам.Сотрудник             = ТекСтрока.Сотрудник;
	Парам.Проект                = ТекСтрока.Проект;
	Парам.AzRyJiraSelectVersion = Число(ТекСтрока.wr_version);
	Если ЗначениеЗаполнено(ТекСтрока.Проект) И Не ЗначениеЗаполнено(ТекСтрока.ЗаданиеНаРаботу) Тогда
		СоздатьДокументЗаданиеНаРаботу(ТекСтрока, Парам);		
	КонецЕсли;	
	
КонецПроцедуры
 
Процедура СоздатьДокументЗаданиеНаРаботу(ТекСтрока, Парам)
	
	// Документ Задание На Работу
	НовыйДокумент = Документы.ЗаданиеНаРаботу.СоздатьДокумент();
	НовыйДокумент.Дата = Парам.Дата;		
	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(НовыйДокумент, Перечисления.ВидыОперацийЗаданиеНаРаботу.Внешнее,Документы.ЗаданиеНаРаботу.ПустаяСсылка(), Неопределено, 0, Новый Структура);
	НовыйДокумент.Организация    = Справочники.Организации.ОсновнаяОрганизация;
	НовыйДокумент.ВидРабот       = Справочники.AzRyНастройки.ЗаданиеНаРаботуВидРабот.Значение;  
	НовыйДокумент.Состояние      = Справочники.СостоянияСобытий.Завершено;
	НовыйДокумент.Сотрудник      = Парам.Сотрудник;
	НовыйДокумент.AzRyПроекты    = Парам.Проект;
	НовыйДокумент.AzRyJiraSelectVersion = Парам.AzRyJiraSelectVersion;
	НовыйДокумент.AzRytempoWorklogId    = ТекСтрока.tempoWorklogId;
	НовыйДокумент.AzRyJiraProject       = ТекСтрока.JiraProject;
	
	// Табличная часть документа
	СгенерироватьТЗДокументаЗаданиеНаРаботу(ТекСтрока, НовыйДокумент, Парам.Проект);
	  
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
	
КонецПроцедуры

Процедура СгенерироватьТЗДокументаЗаданиеНаРаботу(ТекСтрока, НовыйДокумент, Проект)
	
	ДТ = Дата(НовыйДокумент.Дата);
	
	НовыйДокумент.Работы.Очистить();
	НоваяСтрока = НовыйДокумент.Работы.Добавить(); 
	
	Если Не Проект.AzRy_ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
		НоваяСтрока.Заказчик = Проект.AzRy_ЗаказПокупателя;
		НоваяСтрока.AzRyПроект = Проект;
	Иначе 
		Сообщить("პროექტს: " + Проект + " - ს არ აქვს მითითებული შეკვეთის დოკუმენტი");
		ВызватьИсключение "პროექტს: " + Проект + " - ს არ აქვს მითითებული შეკვეთის დოკუმენტი";
	КонецЕсли;
	
	НоваяСтрока.ВидРабот       = Справочники.AzRyНастройки.ЗаданиеНаРаботуВидРабот.Значение;
	НоваяСтрока.Номенклатура   = НоменклатураIssue; 
	НоваяСтрока.ДатаНачала    = Дата(Год(ДТ),Месяц(ДТ),День(ДТ),10,00,00);
	НоваяСтрока.ДатаОкончания = НоваяСтрока.ДатаНачала + ТекСтрока.wr_hours * 3600;
	//НоваяСтрока.Длительность   = СвормироватьДлительностьВЧасах(ТекСтрока.wr_hours);
	НоваяСтрока.Трудоемкость   = ТекСтрока.wr_hours;	
	//НоваяСтрока.Цена = 0;					
	//НоваяСтрока.Сумма = НоваяСтрока.Трудоемкость * НоваяСтрока.Цена;
				
КонецПроцедуры

Функция СвормироватьДлительностьВЧасах(wr_hours)

	ДлительностьВСекундах = wr_hours * (3600);	
	Возврат Дата(0001, 01, 01, 0, 0, 0) + ДлительностьВСекундах;
		
КонецФункции
 
Функция РассчитатьКоличествоДней(КоличествоДнейВСекундах)
	
	МассивЧ = Новый Массив;
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("День", 0);
	//СтруктураПараметров.Вставить("Час", 0);
	//СтруктураПараметров.Вставить("Мин", 0);
	
	//
	//// 1 день
	//Если КоличествоДнейВСекундах = 28800 Тогда 
	//	СтруктураПараметров.Вставить("День", 0);
	//	СтруктураПараметров.Вставить("Час", 8);
	//	СтруктураПараметров.Вставить("Мин", 0);
	//	Возврат СтруктураПараметров;		
	//КонецЕсли;
	
	КонДня = Истина;
	//КонМин = Истина;
	//КонЧас = Истина;
	
	
	// больше чем 1 день
	//Если КоличествоДнейВСекундах > 28800 Тогда 
	
	// Тест -----------------------------
	
	Пока КонДня Цикл
		
		КоличествоДнейВСекундах = КоличествоДнейВСекундах - 28800;
		Если КоличествоДнейВСекундах <= 0 Тогда  
			МассивЧ.Добавить(КоличествоДнейВСекундах + 28800);
			КонДня = Ложь;
		Иначе 
			МассивЧ.Добавить(28800);
		КонецЕсли;				
		
	КонецЦикла;
	
	// Тест -----------------------------
	
	
	//// День -----------------------------
	//НДень = 0;
	//Пока КонДня Цикл
	//	
	//	НДень = НДень + 1;
	//	КоличествоДнейВСекундах = КоличествоДнейВСекундах - 28800; // 8 saaTi
	//	
	//	Если КоличествоДнейВСекундах < 28800 Тогда 
	//		КонДня = Ложь;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//СтруктураПараметров.Вставить("День", НДень - 1);
	//
	//// Час ---------------------------
	//НЧас = 0;
	//Пока КонЧас Цикл
	//	
	//	Если КоличествоДнейВСекундах = 0 Тогда
	//		КонЧас = Ложь; 
	//		Продолжить; 
	//	КонецЕсли;
	//	
	//	НЧас = НЧас + 1;
	//	КоличествоДнейВСекундах = КоличествоДнейВСекундах - 3600; // 1 saaTi
	//	Если КоличествоДнейВСекундах < 3600 Тогда 
	//		КонЧас = Ложь;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//СтруктураПараметров.Вставить("Час", НЧас);
	//
	//// Минута ---------------------------
	//НМин = 0;
	//Пока КонМин Цикл
	//	
	//	Если КоличествоДнейВСекундах = 0 Тогда
	//		КонМин = Ложь; 
	//		Продолжить; 
	//	КонецЕсли;
	//	
	//	НМин = НМин + 1;
	//	КоличествоДнейВСекундах = КоличествоДнейВСекундах - 60; // Минуты
	//	Если КоличествоДнейВСекундах < 60 Тогда 
	//		КонМин = Ложь;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//
	//СтруктураПараметров.Вставить("Мин", Число(?(Формат(НМин, "ЧЦ=2; ЧВН=; ЧГ=0") = "", 0, Формат(НМин, "ЧЦ=2; ЧВН=; ЧГ=0"))));
	
	//Иначе 
	
	//// День ---------------------------
	//СтруктураПараметров.Вставить("День", 0);
	//
	//// Час ---------------------------
	//НЧас = 0;
	//Пока КонЧас Цикл
	//	
	//	Если КоличествоДнейВСекундах < 3600 Тогда
	//		КонЧас = Ложь; 
	//		Продолжить; 
	//	КонецЕсли;
	//	
	//	НЧас = НЧас + 1;
	//	КоличествоДнейВСекундах = КоличествоДнейВСекундах - 3600; // 1 saaTi
	//	Если КоличествоДнейВСекундах < 3600 Тогда 
	//		КонЧас = Ложь;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//СтруктураПараметров.Вставить("Час", НЧас);
	//
	//// Минута ---------------------------
	//НМин = 0;
	//Пока КонМин Цикл
	//	
	//	Если КоличествоДнейВСекундах = 0 Тогда
	//		КонМин = Ложь; 
	//		Продолжить; 
	//	КонецЕсли;
	//	
	//	НМин = НМин + 1;
	//	КоличествоДнейВСекундах = КоличествоДнейВСекундах - 60; // Минуты
	//	Если КоличествоДнейВСекундах < 60 Тогда 
	//		КонМин = Ложь;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//
	//СтруктураПараметров.Вставить("Мин", НМин); 
	
	//КонецЕсли;		
	
	Возврат МассивЧ;
	
КонецФункции

Функция Запрос1СНоменклатураДжираГруппа()

	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Наименование,
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.Номенклатура.НайтиПоКоду("11-00001635"));
		
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции

//Функция СоздатНоменклатуруТаск(СтрокаНаименование, СтрокаАртикул, СтрокаКоментарий)
//	
//	НоваяГруппа = Справочники.Номенклатура.НайтиПоКоду("11-00001635");
//			
//	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
//	НоваяНоменклатура.УстановитьНовыйКод();
//	НоваяНоменклатура.Наименование            = СтрокаНаименование;
//	НоваяНоменклатура.НаименованиеПолное      = СтрокаНаименование;
//	НоваяНоменклатура.Артикул                 = СтрокаАртикул;
//	НоваяНоменклатура.ТипНоменклатуры         = Перечисления.ТипыНоменклатуры.Работа;
//	НоваяНоменклатура.НоменклатурнаяГруппа    = Справочники.НоменклатурныеГруппы.ОсновнаяГруппа;
//	НоваяНоменклатура.ЕдиницаИзмерения        = Справочники.КлассификаторЕдиницИзмерения.ч;
//	НоваяНоменклатура.Родитель                = НоваяГруппа.Ссылка;
//	НоваяНоменклатура.СчетУчетаЗатрат         = ПланыСчетов.Управленческий.КоммерческиеРасходы;
//	НоваяНоменклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
//	НоваяНоменклатура.СтавкаНДС               = Справочники.СтавкиНДС.НайтиПоНаименованию("18%");
//	НоваяНоменклатура.Комментарий             = СтрокаКоментарий;
//	НоваяНоменклатура.Записать();			
//	
//	Возврат НоваяНоменклатура.Ссылка;
//	
//КонецФункции

Функция WorklogsОбновлениеВременыНаСервере() Экспорт

	Для каждого ТекСтрока Из Worklogs Цикл
		Если ТекСтрока.wr_hours <> ТекСтрока.ДлительностьВЧасах И ЗначениеЗаполнено(ТекСтрока.ЗаданиеНаРаботу) Тогда
			ОбновлениеВременыВДокументеЗаданиеНаРаботу(ТекСтрока.wr_hours, ТекСтрока.ЗаданиеНаРаботу);				
		КонецЕсли; 	
	КонецЦикла;	

КонецФункции

Процедура ОбновлениеВременыВДокументеЗаданиеНаРаботу(wr_hours, ЗаданиеНаРаботу)

	ДокОбъект = ЗаданиеНаРаботу.ПолучитьОбъект();
	ДокОбъект.Работы[0].Длительность       = СвормироватьДлительностьВЧасах(wr_hours);
	ДокОбъект.Работы[0].ДлительностьВЧасах = wr_hours;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СписокAccounts(worklogs)

	
	Возврат "";

КонецФункции

Функция ДобавитьЭлементыМассиваВМассив(Массив1, Массив2)

	Для каждого ТекЭлемент Из Массив2 Цикл	
		Массив1.Добавить(ТекЭлемент);		
	КонецЦикла; 
		
	Возврат Массив1;

КонецФункции
 

#КонецОбласти

#Область JiraProjects_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Функция GetJiraProjects() Экспорт
	
	Ответ = ВыполнитьHTTPЗапрос8();
	Если Ответ.ОщибкаСоединения Или Ответ.ОщибкаКодСостояния Тогда
		Ответ.Вставить("ДопИнфо", Неопределено);
		Возврат Ответ;
	КонецЕсли;
	 
	JsonDataJiraProjects = JSON2Текст2(Ответ.Текст);
	ArrayOfResults = JsonDataJiraProjects["values"];
	
	Пока Не JsonDataJiraProjects["isLast"] Цикл
		next = JsonDataJiraProjects["nextPage"];
		next = СтрЗаменить(next, "https://azrystudio.jira.com", "");
		Ответ = ВыполнитьHTTPЗапрос8(next);
		JsonDataJiraProjects = JSON2Текст2(Ответ.Текст);
		ArrayOfResults = ДобавитьЭлементыМассиваВМассив(ArrayOfResults, JsonDataJiraProjects["values"]);
	КонецЦикла;
	
	Ответ2 = ЗаполнитьТаблицуJiraProjects(ArrayOfResults);	
	Ответ.Вставить("ДопИнфо", Ответ2.ДопИнфо);            
	
	Возврат Ответ;
	
КонецФункции

Процедура ОбновитьТЗJiraProjects(JiraProjectIds = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	AzRyJiraProject.Ссылка КАК Ссылка,
		|	AzRyJiraProject.id КАК id
		|ИЗ
		|	Справочник.AzRyJiraProject КАК AzRyJiraProject";
	
	Если Не JiraProjectIds = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ AzRyJiraProject.id В(&id) ";			
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("id", JiraProjectIds);
	
	мJiraProjects = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция ВыполнитьHTTPЗапрос8(Resource = Неопределено)
	
	Ответ = Новый Структура;
	Парам = RESTServices.ПарамертыHTTPЗапрос();
	
	// Headers
	Парам.Headers.Вставить("Authorization", "Basic Z2VvcmdlLm1hbXVsYXNodmlsaUBhenJ5LmNvbTpBVEFUVDN4RmZHRjBGNlBfcDhpLTZpMkRWS01SNXNMdjlJeVNhNUY2MlQ5cFdXVXhYNzBKWFJYd1NiVHphejd5VFltY1lZRXNEN09KdGpCZVNvQ3Fiak9zUi1ienRzOE82N3dRclQ5V1RvYzc4cWNmV1VMWWowQTFNYWpIUnQ4NWppY0w1YmkyZ0lZempOOER6X1I0SmlxeFdSRW1Ea0RrUTcxUS14elZKLWlSOU9IZUIwQnphRWs9OEUzODRCNkE=");
		
	// Соединение 	
	Парам.Соединение.Сервер               = "azrystudio.jira.com";  
	Парам.Соединение.ЗащищенноеСоединение = ЗащищенноеСоединение;
	
	// Resource
	Если Resource = Неопределено Тогда
		Парам.Resource        = "/rest/api/3/project/search?expand=description,lead";
	Иначе 	
		Парам.Resource        = Resource;
	КонецЕсли; 
	Парам.ИмяФайлаЗапроса = ИмяФайлаЗапроса;
	
	Попытка
		HTTPЗапрос = RESTServices.GET(Парам);
	Исключение
		Ответ.Вставить("ОщибкаСоединения", Истина);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", Неопределено);
		Ответ.Вставить("Текст", ОписаниеОшибки());
		Возврат Ответ;
	КонецПопытки;
	
	Если HTTPЗапрос.КодСостояния <> 200 Тогда
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Истина);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Ответ;
	Иначе 	
		Ответ.Вставить("ОщибкаСоединения", Ложь);
		Ответ.Вставить("ОщибкаКодСостояния", Ложь);
		Ответ.Вставить("HTTPЗапрос", HTTPЗапрос);
		Ответ.Вставить("Текст", HTTPЗапрос.ПолучитьТелоКакСтроку());		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;	

КонецФункции

Функция ЗаполнитьТаблицуJiraProjects(МассивJiraProjects)
	
	Парам = Новый Структура("КоличествоНовыеJiraProjects, КоличествоИзмененныйJiraProjects", 0, 0);
	
	Ответ = Новый Структура;
	
	JiraProjects.Очистить();
	Для каждого ТекСтрока Из МассивJiraProjects Цикл	
		НоваяСтрока = JiraProjects.Добавить();
		НоваяСтрока.id             = ТекСтрока["id"];
		НоваяСтрока.projectTypeKey = ТекСтрока["projectTypeKey"];	
		НоваяСтрока.name 		   = ТекСтрока["name"];
		НоваяСтрока.key  		   = ТекСтрока["key"];
		НоваяСтрока._description   = ТекСтрока["description"];
		НоваяСтрока.leadId         = ТекСтрока["lead"]["accountId"];
		
		//ТекСтрока.isPrivate = ТекСтрока["isPrivate"];
		//ТекСтрока.style = ТекСтрока["style"];
		//ТекСтрока.id = ТекСтрока["projectCategory"];		
		//"expand"	"description,lead,issueTypes,url,projectKeys,permissions,insight"					
	КонецЦикла;
	
	ОбновитьТЗJiraProjects(JiraProjects.ВыгрузитьКолонку("id"));
	ТЗСотрудникиДляJiraProjects = ТЗСотрудникиДляJiraProjects(JiraProjects.ВыгрузитьКолонку("leadId"));
	
	Для каждого ТекСтрока Из JiraProjects Цикл
		// ჯირა პროექტის მოძიება
		НайдСтрока = мJiraProjects.Найти(ТекСтрока.id, "id");
		Если НайдСтрока = Неопределено Тогда
			ТекСтрока.Новый = Истина;
			Парам.КоличествоНовыеJiraProjects = Парам.КоличествоНовыеJiraProjects + 1;
		Иначе 
			ТекСтрока.Новый = Ложь;
			ТекСтрока.AzRyJiraProject = НайдСтрока.Ссылка;
			Если СокрЛП(ТекСтрока.name) <> СокрЛП(НайдСтрока.Ссылка.Наименование) Тогда
				ТекСтрока.Измененный = Истина;
				Парам.КоличествоИзмененныйJiraProjects = Парам.КоличествоИзмененныйJiraProjects + 1;
			КонецЕсли; 
		КонецЕсли;
		
		// თანამშრომლების მოძიება
		НайдСтрока = ТЗСотрудникиДляJiraProjects.Найти(ТекСтрока.leadId, "UserAccountId");
		Если Не НайдСтрока = Неопределено Тогда
			ТекСтрока.lead = НайдСтрока.Ссылка;	
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Вставить("ДопИнфо", Парам);
	Возврат Ответ;
	
КонецФункции

Функция СозданиеНовыхJiraProjects() Экспорт
	
	Для каждого ТекСтрока Из JiraProjects Цикл	
		Если ТекСтрока.Новый Тогда		
			ТекСтрока.AzRyJiraProject = СозданиеJiraProject(ТекСтрока);			
		КонецЕсли; 	
	КонецЦикла;
	
КонецФункции

Функция СозданиеJiraProject(Данние)
	
	Спр = Справочники.AzRyJiraProject.ПустаяСсылка();
	Попытка
	
		Спр = Справочники.AzRyJiraProject.СоздатьЭлемент();	
		Спр.id   = Данние.id;
		Спр.key  = Данние.key;
		Спр.Наименование   = Данние.name;
		Спр.name = Данние.name;
		Спр.lead = Данние.lead;
		Спр.projectTypeKey = Данние.projectTypeKey;
		Спр._description   = Данние._description;
		Спр.Записать();
		
	Исключение
	
	КонецПопытки;
	
	Возврат Спр;	

КонецФункции

Функция ТЗСотрудникиДляJiraProjects(Ids) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиAzRyJiraUserIDs.Ссылка,
		|	СотрудникиAzRyJiraUserIDs.id КАК UserAccountId
		|ИЗ
		|	Справочник.Сотрудники.AzRyJiraUserIDs КАК СотрудникиAzRyJiraUserIDs
		|ГДЕ
		|	СотрудникиAzRyJiraUserIDs.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиAzRyJiraUserIDs.id В(&UserAccountId)";
	
	Запрос.УстановитьПараметр("UserAccountId", Ids);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОбновлениеJiraProjects() Экспорт
	
	Для каждого ТекСтрока Из JiraProjects Цикл	
		Если ТекСтрока.Измененный Тогда		
			О = ТекСтрока.AzRyJiraProject.ПолучитьОбъект();
			О.Наименование = ТекСтрока.name;
			О.Записать();
		КонецЕсли; 	
	КонецЦикла;
	
КонецФункции

#КонецОбласти


Функция СоздатьСтрокуBase64(Строка) Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	
	ЗаписьТекста = Новый ЗаписьТекста(ВременныйФайл, "CESU-8");
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	ДД_Файла = Новый ДвоичныеДанные(ВременныйФайл);
	СтрокаBase64 = Base64Строка(ДД_Файла);
	
	УдалитьФайлы(ВременныйФайл);
	
	Возврат СтрокаBase64;
	
КонецФункции // СоздатьСтрокуBase64()

Функция НаименованиеПроекта(Key, Name)

	Возврат СокрЛП(Key) + " - " + СокрЛП(Name);

КонецФункции

Функция getMaxSelectVersion() Экспорт
	
	Ответ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаданиеНаРаботу.AzRyJiraSelectVersion) КАК JiraSelectVersion
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Проведен = ИСТИНА
		|	И ЗаданиеНаРаботу.Дата >= &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата(2021, 1, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ?(ВыборкаДетальныеЗаписи.JiraSelectVersion = Null, 0, ВыборкаДетальныеЗаписи.JiraSelectVersion); 	
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция GetMaxVertionByDate(Дата) Экспорт
	
	ТЗ = Worklogs.Выгрузить();
	ТЗ.Колонки.Добавить("wr_date2");
	Для каждого ТекСтрока Из ТЗ Цикл	
		ТекСтрока.wr_date2 = Дата(СтрЗаменить(ТекСтрока.wr_date, "-", "")); 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Worklogs.wr_date,
		|	Worklogs.wr_version
		|ПОМЕСТИТЬ MaxVertion
		|ИЗ
		|	&ТЗ КАК Worklogs
		|ГДЕ
		|	Worklogs.wr_date2 МЕЖДУ &wr_date1 И &wr_date2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(MaxVertion.wr_version) КАК wr_version1
		|ИЗ
		|	MaxVertion КАК MaxVertion";
	
	
	Запрос.Параметры.Вставить("ТЗ", ТЗ);
	Запрос.Параметры.Вставить("wr_date1", НачалоМесяца(Дата));
	Запрос.Параметры.Вставить("wr_date2", КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.wr_version1;		
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ <Наименование>

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

RESTServices          = Обработки.AzRyHTTPЗапрос.Создать();
ЗащищенноеСоединение  = Новый ЗащищенноеСоединениеOpenSSL;
JsonData              = Неопределено;

#Область Accounts_and_AccountCategories_ОПЕРАТОРЫ
Сервер                = "api.tempo.io";
Resource              = "core/3";
Authorization         = "Bearer Lqjcf5cjGa0ZuuKpKEqEqk4u3Qa9N8";

// Temp solution
СписокИсключений = Новый СписокЗначений;
СписокИсключений.Добавить("Amazon");
СписокИсключений.Добавить("Facebook Posts");
СписокИсключений.Добавить("Facebook Communication");
СписокИсключений.Добавить("LinkedIn Posts");
СписокИсключений.Добавить("LinkedIn Communication");
СписокИсключений.Добавить("AzRy Website");
СписокИсключений.Добавить("Tenders");
СписокИсключений.Добавить("Intelligence Gathering");
СписокИсключений.Добавить("Branding");
СписокИсключений.Добавить("Workplace Posts");

СписокИсключений.Добавить("PIIVRC Passenger Information System Rustavi");
СписокИсключений.Добавить("Mini Bus Integration in TPTS");
СписокИсключений.Добавить("LCS for Crystal");
СписокИсключений.Добавить("UMTS for Crystal");
СписокИсключений.Добавить("MS for Crystal");
#КонецОбласти

#Область Worklogs_ОПЕРАТОРЫ
НоменклатураIssue     = Справочники.Номенклатура.НайтиПоКоду("11-00056099");
#КонецОбласти
